#+TITLE:Static Generator for Org Files
#+DATE: 2017-11-18
#+OPTIONS: _:{} ^:{} toc:nil num:nil
#+CREATOR: 


** find all pages
  We're creating a py file in ~../src~, but running this from an org file in the directory we expect all the files to already be in.
  ~../reports~ will work for a file launched in either location. All is lost if we run the code outside of the directory it lives.
  
 We use the function above to pull out info on the file
#+BEGIN_SRC python :tangle ../src/make_index.py :session :results none :exports none
  # ### find all the files we want to use as reports
  import pandas
  # editing org file we are in ../reports, as file we are in ../src
  os.chdir('../reports')
  filelist = [ {**file_stat(f), **file_info(f)} for f in glob.glob('*.org') ]
  # reverse sort by date
  filelist = sorted(filelist,key=lambda x: x['date'],reverse=True)
  # as a dataframe
  file_df = pandas.DataFrame(filelist)
#+END_SRC

#+BEGIN_SRC python :session :results raw  :exports both
from tabulate import tabulate
tabulate(file_df.head(n=5),headers="keys", tablefmt="orgtbl",showindex=False)
#+END_SRC

#+RESULTS:
|       date | f              | mt                         | title      |
|------------+----------------+----------------------------+------------|
| 2017-11-18 | make_index.org | 2017-11-18 19:47:22.007319 | make_index |

